In [1]:
import pandas as pd

In [2]:
# Ejercicio 1: Importar Pandas y leer el dataset del Titanic.

In [3]:
# Ejercicio 2: Mostrar las primeras 10 filas del dataset.

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
5          897       3                    Svensson, Mr. Johan Cervin    male
6          898       3                          Connolly, Miss. Kate  female
7          899       2                  Caldwell, Mr. Albert Francis    male
8          900       3     Abrahim, Mrs. Joseph (Sophie Halaut Easu)  female
9          901       3                       Davies, Mr. John Samuel    male

    Age  SibSp  Parch     Ticket     Fare Cabin Embarked  Survived
0  34.5      0      0     330911   7.8292   NaN        Q       NaN
1  47.0      1      0     363272   7.0000   NaN        S       NaN
2  62.0      0      0     240276   9.6875   NaN        Q       NaN
3  27.0      0      0     315154   8.6625   NaN        S       NaN
4  22.0      1      1    3101298  12.2875   NaN        S       NaN
5  14.0      0      0       7538   9.2250   NaN        S       NaN
6  30.0      0      0     330972   7.6292   NaN        Q       NaN
7  26.0      1      1     248738  29.0000   NaN        S       NaN
8  18.0      0      0       2657   7.2292   NaN        C       NaN
9  21.0      2      0  A/4 48871  24.1500   NaN        S       NaN

In [4]:
# Ejercicio 3: Identificar y contar los tipos de datos de cada columna.

object     5
int64      4
float64    3
Name: count, dtype: int64

In [5]:
# Ejercicio 4: Encontrar y contar valores faltantes en el dataset.

PassengerId       0
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
Survived        418
dtype: int64

In [6]:
# Ejercicio 5: Listar nombres de columnas y cambiar cualquier nombre inapropiado.

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [7]:
# Supongamos que queremos cambiar 'SibSp' por 'Siblings_Spouses'

,PassengerId,Pclass,Name,Sex,Age,Siblings_Spouses,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,NaN
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,NaN
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0

In [9]:
# Ejercicio 6: Seleccionar solo las columnas 'Edad', 'Sexo', y 'Sobreviviente'.

      Age     Sex  Survived
0    22.0    male       0.0
1    38.0  female       1.0
2    26.0  female       1.0
3    35.0  female       1.0
4    35.0    male       0.0
..    ...     ...       ...
885  39.0  female       0.0
886  27.0    male       0.0
887  19.0  female       1.0
889  26.0    male       1.0
890  32.0    male       0.0

[714 rows x 3 columns]

In [11]:
# Ejercicio 7: Contar el número de sobrevivientes y no sobrevivientes.

Survived
0.0    549
1.0    342
Name: count, dtype: int64

In [12]:
# Ejercicio 8: Calcular la edad promedio de los pasajeros.

29.881137667304014

,PassengerId,Pclass,Name,Sex,Age,Siblings_Spouses,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,NaN
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,NaN
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0

In [14]:
# Ejercicio 9: Determinar el número de pasajeros por clase de boleto.

Pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [15]:
# Ejercicio 10: Extraer el título (Mr, Mrs, Miss, etc.) de cada nombre y crear una nueva columna.

,PassengerId,Pclass,Name,Sex,Age,Siblings_Spouses,Parch,Ticket,Fare,Cabin,Embarked,Survived,Title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,NaN,Mr
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,NaN,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,NaN,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0,Rev
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0,Miss
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0,Miss
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0,Mr
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0,Mr

In [16]:
# Ejercicio 11: Crear una columna indicando si el pasajero viajaba solo o con familia.

In [17]:
# Ejercicio 12: Contar cuántos pasajeros únicos hay de cada título.

Unique titles count: 18
Title
Mr          757
Miss        260
Mrs         197
Master       61
Rev           8
Dr            8
Col           4
Ms            2
Major         2
Mlle          2
Sir           1
Countess      1
Capt          1
Don           1
Lady          1
Mme           1
Dona          1
Jonkheer      1
Name: count, dtype: int64

In [18]:
# Ejercicio 13: Calcular la tarifa media pagada por clase de pasajero.

In [19]:
# Ejercicio 14: Encontrar la edad más joven y más vieja en cada clase.

In [20]:
# Ejercicio 15: Calcular el número total de familiares a bordo por pasajero.

In [21]:
# Ejercicio 16: Agrupar datos por género y encontrar la edad media, mínima y máxima.

In [22]:
# Ejercicio 17: Identificar la fila con la tarifa más alta pagada.

In [23]:
# Ejercicio 18: Contar cuántos pasajeros embarcaron en cada puerto.

In [24]:
# Ejercicio 19: Determinar si hay duplicados en el dataset y tratarlos.
# Para eliminar duplicados (si existieran), usaríamos: titanic_data = titanic_data.drop_duplicates()

In [25]:
# Ejercicio 20: Convertir la columna 'Sexo' a una variable numérica (0 para masculino, 1 para femenino).

In [26]:
# Ejercicio 21: Eliminar columnas que no aportan información relevante.

In [27]:
# Ejercicio 22: Rellenar valores faltantes en 'Edad' con la mediana de la misma.

In [28]:
# Ejercicio 23: Rellenar valores faltantes en 'Puerto de Embarque' con la moda.

In [29]:
# Ejercicio 24: Eliminar filas donde la 'Tarifa' esté faltando.

In [30]:
# Ejercicio 25: Normalizar las columnas numéricas (Edad y Tarifa).

In [31]:
import numpy as np

# Ejercicio 26: Categorizar la edad en grupos ('Niño', 'Adulto', 'Senior').

In [32]:
# Ejercicio 27: Crear una columna de 'Título' limpio agrupando títulos menos comunes en 'Otros'.

In [33]:
# Ejercicio 28: Codificar la columna 'Puerto de Embarque' con variables dummy.

In [34]:
# Ejercicio 29: Separar el dataset en dos: uno con datos de supervivientes y otro con los que no sobrevivieron.

In [35]:
# Ejercicio 30: Crear un índice único para cada pasajero.

In [36]:
# Ejercicio 31: Combinar columnas de 'Siblings_Spouses' y 'Parch' en una 'Tamaño de Familia'.

In [37]:
# Ejercicio 32: Identificar y tratar outliers en la 'Edad' y 'Tarifa'.
# Definir una función para detectar outliers basados en el rango intercuartil.
def detect_outliers(df, col):
    Q1 = df[col].quantile(0.25)
    Q3 = df[col].quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    return df[(df[col] < lower_bound) | (df[col] > upper_bound)]

# Aplicar la función y obtener índices de outliers.

In [38]:
# Ejercicio 33: Dividir el nombre completo en 'Nombre', 'Apellido', y 'Título'.

In [39]:
# Ejercicio 34: Convertir todas las cadenas en la columna 'Título' a mayúsculas.

In [40]:
# Ejercicio 35: Agrupar por 'Título' y calcular la media de 'Edad' y 'Tarifa'.

In [41]:
# Ejercicio 36: Ordenar el dataset por 'Edad' de manera ascendente.

In [42]:
# Ejercicio 37: Resetear el índice del DataFrame después de cualquier operación de ordenamiento.

In [43]:
# Ejercicio 38: Identificar correlaciones entre 'Edad', 'Tarifa', y 'Tamaño de Familia'.

In [44]:
# Ejercicio 39: Eliminar cualquier fila con valores negativos en 'Tarifa'.

In [45]:
# Ejercicio 40: Guardar el dataset limpio en un nuevo archivo CSV.

In [46]:
# Ejercicio 41: Aplicar una función que convierta la edad en días (aproximada).

In [47]:
# Ejercicio 42: Calcular la tarifa media pagada por los pasajeros de cada puerto de embarque.

In [48]:
# Ejercicio 43: Crear una columna 'Edad * Clase' como interacción de edad y clase.

In [49]:
# Ejercicio 44: Establecer rangos de tarifas (bajo, medio, alto) basados en cuartiles.

In [50]:
# Ejercicio 45: Contar cuántos pasajeros sobrevivieron por cada rango de tarifa.

C:\Users\adema\AppData\Local\Temp\ipykernel_38288\1281865946.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival_by_fare_range = titanic_data.groupby('FareRange')['Survived'].sum()

In [51]:
# Ejercicio 46: Agrupar por 'Sexo' y 'Clase' y calcular la supervivencia promedio.

In [52]:
# Ejercicio 47: Identificar pasajeros con el mismo apellido y ver si sobrevivieron.

In [53]:
# Ejercicio 48: Crear una puntuación de supervivencia basada en características (fórmula propia).
# Nota: Esto es un ejemplo y puede variar según el criterio del analista.

In [54]:
# Ejercicio 49: Establecer un ranking de tarifas pagadas y encontrar los top 10 pasajeros que más pagaron.

In [55]:
# Ejercicio 50: Agrupar por 'Tamaño de Familia' y analizar la tasa de supervivencia.

In [56]:
# Ejercicio 51: Calcular la varianza y desviación estándar de la 'Edad' por 'Clase'.

In [57]:
# Ejercicio 52: Mapear la 'Edad' a categorías ('Niño', 'Joven', 'Adulto', 'Senior').

In [58]:
# Ejercicio 53: Crear una función que etiquete a los pasajeros como 'Niño', 'Mujer Adulta' o 'Hombre Adulto'.

In [59]:
# Ejercicio 54: Contar cuántos títulos únicos hay y cuál es el más común.

In [60]:
# Ejercicio 55: Combinar 'SibSp' y 'Parch' en una columna 'Tamaño de Familia' y analizar su impacto en la supervivencia.

In [61]:
# Ejercicio 56: Comparar la tasa de supervivencia entre diferentes rangos de edad y tarifas.

C:\Users\adema\AppData\Local\Temp\ipykernel_38288\2638681024.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival_by_age_fare = titanic_data.groupby(['AgeCategory', 'FareRange'])['Survived'].mean()

In [62]:
# Ejercicio 57: Implementar una codificación de frecuencia para la columna 'Título'.

In [63]:
# Ejercicio 58: Calcular y analizar la tasa de supervivencia por cada combinación de 'Puerto de Embarque' y 'Sexo'.